# Завдання 1
# У списку цілих, заповненому випадковими числами обчислити:
# ■ Суму негативних чисел;
# ■ Суму парних чисел;
# ■ Суму непарних чисел;
# ■ Добуток елементів з кратними індексами 3;
# ■ Добуток елементів між мінімальним та максимальним елементом;
# ■ Суму елементів, що знаходяться між першим та останнім позитивними елементами.
#
# Завдання 2
# Є список цілих, заповнений випадковими числами.
# На підставі даних цього масиву потрібно:
# ■ Створити список цілих, що містить лише парні числа з першого списку;
# ■ Створити список цілих, що містить лише непарні числа з першого списку;
# ■ Створити список цілих, що містить лише негативні числа з першого списку;
# ■ Створити список цілих, що містить лише позитивні числа з першого списку.
#
# Додаткові завдання по матрицях (надіслати як завжди мені в лс після виконання
# основного дз):
# -створити матрицю 10 на 10, заповнити рандомними значеннями від 10 до 99
# -вивести на екран
# - вивести суму чисел головної діагоналі матриці
# - вивести мінімальне та максимальне значення побічної діагоналі матриці
# - ввести з клавіатури порядковий номер стовпця - вивести цифри з цього
#  стовпця на екран (аналогічно зробити з рядком)
# - ввести з клавіатури порядковий номер одного стовпця і потім іншого стовпця
# і поміняти їх місцями в матрицю (аналогічно зробити з рядком)

import random
num1 = int(input("Введіть початок масиву: "))
num2 = int(input("Введіть кінець масиву: "))
Num_size = 10
numbers = []
for i in range(Num_size):
    if num1 < num2:
        numbers.append(random.randint(num1, num2))
    elif num1 > num2:
        numbers.append(random.randint(num2, num1))
print(numbers)
# Сума негативних чисел
# count_neg_sum = 0
# for i in numbers:
#     if i < 0:
#         count_neg_sum -= - i
# print(count_neg_sum)
# # Сума парних чисел
# count_paired_sum = 0
# for i in numbers:
#     if i % 2 == 0:
#         count_paired_sum += i
# print(count_paired_sum)
#
# # Сума непарних чисел
# count_unpaired_sum = 0
# for i in numbers:
#     if i % 2 != 0:
#         count_unpaired_sum += i
# print(count_unpaired_sum)

# Добуток елементів з індексами кратними 3
# print(numbers[3:10:3])
# multi = 1
# for i in range(len(numbers)):
#     if i % 3 == 0 and i != 0:
#         multi *= numbers[i]
# print(multi)




